"""
Функціонал для роботи із записною книгою

Пошук: Пошку виконується за строкою або за регулярним вираженням залежно від того, що ви хочете знайти. 
Наприклад, якщо ви хочете знайти всі записи, які містять слово "купити", ви можете використовувати текст "купити". 
Якщо ви хочете знайти всі записи, які починаються з літери "А", ви можете використати текст "^A". 
Якщо ви хочете знайти всі записи, які закінчуються на цифру, ви можете використовувати текст "\d$".
Приклад виклику: search_text(records, "купити")

"""
import re

class Notes:

    # Метод пошуку
    def search_text(records, text):
        # Створюємо порожній список для результатів
        results = []
        # Компілюємо регулярний вираз із тексту
        pattern = re.compile(text)
        # Перебираємо всі записи
        for record in records:
            # Перевіряємо, чи є збіг з регулярним виразом у записі
            if pattern.search(record):
                # Додаємо запис до списку результатів
                results.append(record)
        # Повертаємо перелік результатів
        return results
