"""
Функціонал для роботи із записною книгою

Збереження: Збереження виконується у режимі 'wb', 
тобто відкриває файл як для запису, так читання у двійковому форматі. 
Перезаписує існуючий файл, якщо він існує. 
Якщо файл не існує, створюється новий файл для читання та запису.
При збережені використовується функція dump модуля pickle - записує серіалізований об'єкт у файл. 
Серіалізація - перетворення об'єкта Python на потік байтів.
При виклику методу пропонується використовувати змінну FILENAME.
Приклад виклику: .save(self, "FILENAME")
"""
import pickle

# Назва файлу
FILENAME = "notes.dat"


class Notes:

    # Метод збереження
    def save(self, filename):
        # Відкриваємо файл для збереження
        with open(filename, 'wb') as file:
            # зберігаємо серіалізовані дані
            pickle.dump(self, file)
